# messages_es.properties
#
# Copyright (C) 2019 Universidad de Sevilla
# 
# The use of this project is hereby constrained to the conditions of the 
# TDG Licence, a copy of which you may download from 
# http://www.tdg-seville.info/License.html

typeMismatch.java.util.Date		= Momento inválido
typeMismatch.double				= Cantidad inválida

javax.validation.constraints.DecimalMax.message  = Muy grande (max = {value})
javax.validation.constraints.DecimalMin.message  = Muy pequeño (min = {value})
javax.validation.constraints.Digits.message      = Fuera de rango ({integer}.{fraction})
javax.validation.constraints.Max.message         = Muy grande (max = {value})
javax.validation.constraints.Min.message         = Muy pequeño (min = {value})
javax.validation.constraints.Past.message        = Debe ser en el pasado
javax.validation.constraints.Future.message      = Debe ser en el futuro
javax.validation.constraints.Size.message        = El tamaño debe estar entre {min} y {max}

javax.validation.constraints.Pattern.message     = No encaja en el patrón
#javax.validation.constraints.Pattern.message     = No encaja en el patrón "{regexp}"
javax.validation.constraints.AssertFalse.message = Debe ser false
javax.validation.constraints.AssertTrue.message  = Debe ser true
javax.validation.constraints.NotNull.message     = No puede ser null
javax.validation.constraints.Null.message        = Debe ser null

org.hibernate.validator.constraints.CreditCardNumber.message = Número incorrecto
org.hibernate.validator.constraints.Email.message            = E-mail incorrecto
org.hibernate.validator.constraints.URL.message              = URL incorrecta
org.hibernate.validator.constraints.Length.message           = La longitud debe ser entre {min} y {max}
org.hibernate.validator.constraints.NotBlank.message         = No debe estar en blanco
org.hibernate.validator.constraints.NotEmpty.message         = No debe estar vacío
org.hibernate.validator.constraints.Range.message            = Fuera de rango ({min}-{max})
org.hibernate.validator.constraints.SafeHtml.message         = HTML inseguro
org.hibernate.validator.constraints.ScriptAssert.message     = "{script}" ha devuelto false

panic.text 		  = Disculpe las molestias.  Se ha producido la siguiente excepción:  
panic.message 	  = Mensaje
panic.stack.trace = Traza


terms.p=<p>Esta pol&iacute;tica de privacidad ha sido redactada al amparo de lo dispuesto en el REGLAMENTO (UE) 2016/679 DEL PARLAMENTO EUROPEO Y DEL CONSEJO de 27 de abril de 2016 relativo a la protecci&oacute;n de las personas f&iacute;sicas en lo que respecta al tratamiento de datos personales y a la libre circulaci&oacute;n de estos datos (RGPD), en la Ley Org&aacute;nica 15/1999, de 13 de diciembre, de Protecci&oacute;n de Datos de Car&aacute;cter Personal (LOPD) y en su reglamento de desarrollo. </p><p><strong>Identificaci&oacute;n del titular de la web </strong></p><p>El titular de esta web es Acme Inc., con NIF ..., con domicilio a estos efectos en Avenida de la Reina Mercedes, 41011 - Sevilla (Espa&ntilde;a), y con direcci&oacute;n de correo electr&oacute;nico: <span class="MsoNormal" style="MARGIN-BOTTOM: 12pt">acme@help.com</span></p><p><strong>&iquest;Qui&eacute;n es el responsable de los datos personales que recabamos en esta web? </strong></p><p>El responsable del tratamiento es Acme Inc, S.L. con NIF ..., con domicilio a estos efectos en Avenida de la Reina Mercedes, 41011 - Sevilla (Espa&ntilde;a), y con direcci&oacute;n de correo electr&oacute;nico: <span class="MsoNormal" style="MARGIN-BOTTOM: 12pt">acme@help.com</span></p><p><strong>&iquest;Qu&eacute; datos vamos a obtener de ti? </strong></p><p>En nuestra web los &uacute;nicos datos personales que podremos recabar de ti son los que nos facilites en el momento de registrarte. </p><p><strong>&iquest;Cu&aacute;l es la finalidad de este tratamiento de datos?</strong></p><p>Trataremos tus datos personales para las siguientes finalidades: </p><p>&bull;	Mantener tu usuario activo en nuestros servicios.</p><p> &bull;	Podremos utilizar tu direcci&oacute;n de correo electr&oacute;nico para enviarte notificaciones y avisos de eventos que te conciernan acerca del servicio. </p><p><strong>&iquest;Cu&aacute;l es la base jur&iacute;dica de estos tratamientos de datos?</strong></p><p>La base jur&iacute;dica es el inter&eacute;s leg&iacute;timo en abrir tu cuenta de usuario en nuestro servicio al registrarte as&iacute; como enviarte las notificaciones del servicio.</p><p><strong>&iquest;Durante cu&aacute;nto tiempo se van a conservar los datos? </strong></p><p>Conservaremos tus datos personales mientras hagas uso de nuestros foros y servicios y hasta que solicites la baja. </p><p>En cualquier momento podr&aacute;s escribirnos para solicitar la supresi&oacute;n de tus datos o la baja de tu usuario; en ese caso, tus datos personales quedar&aacute;n bloqueados durante 3 a&ntilde;os, a disposici&oacute;n exclusiva de Jueces y Tribunales, el Ministerio Fiscal, la Agencia Espa&ntilde;ola de Protecci&oacute;n de Datos y dem&aacute;s autoridades y Administraciones P&uacute;blicas competentes, para resolver cualquier cuesti&oacute;n o responsabilidad relacionada con el tratamiento de tus datos o con el ejercicio de acciones legales, reclamaciones o consultas posteriores, durante el plazo de prescripci&oacute;n de las mismas. </p><p><strong>Destinatario o categor&iacute;as de destinatarios de los datos</strong></p><p>Tus datos personales no ser&aacute;n facilitados ni cedidos a ninguna entidad ajena a este portal. </p><p>Utilizamos los servicios de dos compa&ntilde;&iacute;as para alojar las bases de datos de este foro y servicio: Clever Cloud SAS. </p><p><strong>Transferencias internacionales de datos</strong></p><p>No realizamos transferencias internacionales de datos de ning&uacute;n tipo ni categor&iacute;a.</p><p><strong>&iquest;Qu&eacute; derechos asisten al usuario? </strong></p><p>El RGPD te otorga los siguientes derechos, que podr&aacute;s ejercerlos enviando un correo electr&oacute;nico a <strong>privacidad@acme.com</strong>; ser&aacute; necesario que el correo electr&oacute;nico nos lo env&iacute;es desde la misma direcci&oacute;n que utilizaste para registrarte.</p><p><strong>Derecho de acceso</strong></p><p>Tienes derecho a obtener confirmaci&oacute;n de si se est&aacute;n tratando o no datos personales que te conciernen y, en tal caso, derecho de acceso a los datos personales y a la informaci&oacute;n relacionada con su tratamiento. <br>Tienes derecho a obtener una copia de los datos personales objeto de tratamiento. </p><p><strong>Derecho de rectificaci&oacute;n</strong></p><p>Tienes derecho a obtener sin dilaci&oacute;n indebida la rectificaci&oacute;n de los datos personales inexactos que te conciernen. Teniendo en cuenta los fines del tratamiento, tendr&aacute;s derecho a que se completen los datos personales que sean incompletos. </p><p><strong>Derecho de supresi&oacute;n</strong></p><p>Tienes derecho a obtener sin dilaci&oacute;n indebida la supresi&oacute;n de los datos personales que te conciernen. </p><p>Estamos obligados a suprimir sin dilaci&oacute;n indebida los datos personales cuando concurra alguna de las circunstancias siguientes: </p><p>a) los datos personales ya no sean necesarios en relaci&oacute;n con los fines para los que fueron recogidos o tratados de otro modo; </p><p>b) &nbsp;el interesado retire el consentimiento prestado para fines espec&iacute;ficos o el consentimiento expreso prestado para el tratamiento de categor&iacute;as especiales de datos, como los que revelen sus opiniones pol&iacute;ticas, mientras este tratamiento no se base en otro fundamento jur&iacute;dico; </p><p> c) &nbsp;el interesado se oponga al tratamiento por motivos relacionados con su situaci&oacute;n particular y no prevalezcan otros motivos leg&iacute;timos para el tratamiento; </p><p> d) &nbsp;los datos personales hayan sido tratados il&iacute;citamente; </p><p> e) &nbsp;los datos personales deban suprimirse para el cumplimiento de una obligaci&oacute;n legal establecida en el Derecho de la Uni&oacute;n o de los Estados miembros que se aplique al responsable del tratamiento. </p><p>No ser&aacute; aplicable la obligaci&oacute;n de supresi&oacute;n de los datos personales cuando el tratamiento sea necesario para: </p><p>a) &nbsp;ejercer el derecho a la libertad de expresi&oacute;n e informaci&oacute;n; </p><p> b) &nbsp;el cumplimiento de una obligaci&oacute;n legal que requiera el tratamiento de datos impuesta por el Derecho de la Uni&oacute;n o de los Estados miembros que se aplique al responsable del tratamiento; </p><p> c) &nbsp;el cumplimiento de una misi&oacute;n realizada en inter&eacute;s p&uacute;blico o en el ejercicio de poderes p&uacute;blicos conferidos al responsable; </p><p> d) &nbsp;con fines de archivo en inter&eacute;s p&uacute;blico, fines de investigaci&oacute;n cient&iacute;fica o hist&oacute;rica o fines estad&iacute;sticos, en la medida en que el derecho a la supresi&oacute;n pudiera hacer imposible u obstaculizar gravemente el logro de los objetivos de dicho tratamiento; </p><p> e) &nbsp;para la formulaci&oacute;n, el ejercicio o la defensa de reclamaciones. </p><p><strong>Limitaci&oacute;n del tratamiento</strong></p><p>Tienes derecho a obtener la limitaci&oacute;n del tratamiento de los datos cuando se cumpla alguna de las condiciones siguientes: </p><p>a) Impugnes la exactitud de los datos personales, durante un plazo que nos permita verificar la exactitud de los mismos; <br>  b) El tratamiento sea il&iacute;cito y te opongas a la supresi&oacute;n de los datos personales y solicites en su lugar la limitaci&oacute;n de su uso; <br>  c) No necesitemos los datos personales para los fines del tratamiento, pero los necesites para la formulaci&oacute;n, el ejercicio o la defensa de reclamaciones; <br>  d) Te hayas opuesto al tratamiento por motivos relacionados con tu situaci&oacute;n particular, mientras se verifica si los motivos leg&iacute;timos como responsable del tratamiento prevalecen sobre los del interesado. </p><p><strong>Portabilidad de los datos </strong></p><p>Tienes derecho a recibir los datos personales que te incumban, en un formato estructurado, de uso com&uacute;n y lectura mec&aacute;nica. </p><p><strong>Oposici&oacute;n al tratamiento</strong></p><p>Tienes derecho a oponerte en cualquier momento, por motivos relacionados con tu situaci&oacute;n particular, a que datos personales que te conciernan sean objeto de un tratamiento basado en lo dispuesto en el art&iacute;culo 6, apartado 1, letras e) o f) del RGPD. Dejaremos de tratar los datos personales, salvo que acreditemos motivos leg&iacute;timos imperiosos para el tratamiento que prevalezcan sobre los intereses, los derechos y las libertades del interesado, o para la formulaci&oacute;n, el ejercicio o la defensa de reclamaciones. </p><p><strong>Revocaci&oacute;n del consentimiento </strong></p><p>Tienes derecho a retirar en cualquier momento el consentimiento que nos diste para tratar tus datos personales. </p><p><strong>Reclamaci&oacute;n ante las autoridades de protecci&oacute;n de datos </strong></p><p>Tienes derechos a reclamar ante las autoridades de control en materia de protecci&oacute;n de datos si consideras que tus datos personales no est&aacute;n siendo tratados de forma correcta. </p><p><strong>Tratamiento de datos de menores de edad </strong></p><p>Nuestros servicios deben ser utilizados por mayores de 14 a&ntilde;os, por lo que en el caso de que no tengas esta edad deber&aacute;s abstenerte de utilizarlos. </p><p>Podremos requerir documentaci&oacute;n oficial para acreditar la edad. </p>

